# SERIES OBJECT IN PANDAS

In [3]:
import pandas as pd
data=[1,2,3,4]
series1=pd.Series(data)
series1

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(series1)

pandas.core.series.Series

In [6]:
#Changing the index of a series object
series1=pd.Series(data,index=['a','b','c','d'])
series1

a    1
b    2
c    3
d    4
dtype: int64

# How to create a dataframe

In [7]:
#creating a dataframe using a list
import pandas as pd
data=[1,2,3,4,5]
df=pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5

In [8]:
#creating a dataframe using a dictionary
dictionary={'fruits':['apples','banana','mangoes'],'count':[10,20,15]}
df=pd.DataFrame(dictionary)
df

    fruits  count
0   apples     10
1   banana     20
2  mangoes     15

In [9]:
#creating a dataframe using a series
series=pd.Series(['6','12'],index=['a','b'])
df=pd.DataFrame(series)
df

    0
a   6
b  12

In [11]:
#creating a dataframe using a numpy array
import numpy as np
numpyarray=np.array([[50000,60000,70000],['SIRAJ','MIRAJ','RAJA'],['Assistant','General Manager','Manager']])
df=pd.DataFrame({'Name':numpyarray[1],'Salary':numpyarray[0],'Status':numpyarray[2]})
df

    Name Salary           Status
0  SIRAJ  50000        Assistant
1  MIRAJ  60000  General Manager
2   RAJA  70000          Manager

# How to perform a merge operation?

In [12]:
import pandas as pd
player=['player1','player2','player3']
point=[8,9,6]
title=['Game1','Game2','Game3']
df1=pd.DataFrame({'Player':player,'Points':point,'Title':title})
df1

    Player  Points  Title
0  player1       8  Game1
1  player2       9  Game2
2  player3       6  Game3

In [13]:
player=['player1','player5','player6']
power=['Punch','Kick','Elbow']
title=['Game1','Game5','Game6']
df2=pd.DataFrame({'Player':player,'Power':power,'Title':title})
df2

    Player  Power  Title
0  player1  Punch  Game1
1  player5   Kick  Game5
2  player6  Elbow  Game6

In [15]:
#inner merge
df1.merge(df2,on='Title',how='inner')

  Player_x  Points  Title Player_y  Power
0  player1       8  Game1  player1  Punch

In [16]:
#Left Merge
df1.merge(df2,on='Player',how='left')

    Player  Points Title_x  Power Title_y
0  player1       8   Game1  Punch   Game1
1  player2       9   Game2    NaN     NaN
2  player3       6   Game3    NaN     NaN

In [17]:
#Right Merge
df1.merge(df2,on='Player',how='right')

    Player  Points Title_x  Power Title_y
0  player1     8.0   Game1  Punch   Game1
1  player5     NaN     NaN   Kick   Game5
2  player6     NaN     NaN  Elbow   Game6

In [18]:
#Outer Merge
df1.merge(df2,on='Title',how='outer')

  Player_x  Points  Title Player_y  Power
0  player1     8.0  Game1  player1  Punch
1  player2     9.0  Game2      NaN    NaN
2  player3     6.0  Game3      NaN    NaN
3      NaN     NaN  Game5  player5   Kick
4      NaN     NaN  Game6  player6  Elbow

# How to perform join operation in pandas?

In [24]:
player=['player1','player2','player3']
point=[8,9,6]
title=['Game1','Game2','Game3']
df3=pd.DataFrame({'Player':player,'Points':point,'Title':title},index=['L1','L2','L3'])
df3

     Player  Points  Title
L1  player1       8  Game1
L2  player2       9  Game2
L3  player3       6  Game3

In [21]:
player=['player1','player5','player6']
power=['Punch','Kick','Elbow']
title=['Game1','Game5','Game6']
df4=pd.DataFrame({'Players':player,'Power':power,'Titles':title},index=['L2','L3','L4'])
df4

    Players  Power Titles
L2  player1  Punch  Game1
L3  player5   Kick  Game5
L4  player6  Elbow  Game6

In [25]:
#inner join
df3.join(df4,how='inner')

     Player  Points  Title  Players  Power Titles
L2  player2       9  Game2  player1  Punch  Game1
L3  player3       6  Game3  player5   Kick  Game5

In [26]:
#Left join
df3.join(df4,how='left')

     Player  Points  Title  Players  Power Titles
L1  player1       8  Game1      NaN    NaN    NaN
L2  player2       9  Game2  player1  Punch  Game1
L3  player3       6  Game3  player5   Kick  Game5

In [27]:
#Right Join
df3.join(df4,how='right')

     Player  Points  Title  Players  Power Titles
L2  player2     9.0  Game2  player1  Punch  Game1
L3  player3     6.0  Game3  player5   Kick  Game5
L4      NaN     NaN    NaN  player6  Elbow  Game6

In [28]:
#outer join
df3.join(df4,how='outer')

     Player  Points  Title  Players  Power Titles
L1  player1     8.0  Game1      NaN    NaN    NaN
L2  player2     9.0  Game2  player1  Punch  Game1
L3  player3     6.0  Game3  player5   Kick  Game5
L4      NaN     NaN    NaN  player6  Elbow  Game6

# How to concatinate two dataframe?

In [29]:
pd.concat([df3,df4])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     Player  Players  Points  Power  Title Titles
L1  player1      NaN     8.0    NaN  Game1    NaN
L2  player2      NaN     9.0    NaN  Game2    NaN
L3  player3      NaN     6.0    NaN  Game3    NaN
L2      NaN  player1     NaN  Punch    NaN  Game1
L3      NaN  player5     NaN   Kick    NaN  Game5
L4      NaN  player6     NaN  Elbow    NaN  Game6

In [ ]:
#import pandas library
import pandas as pd
cars=